app/Models/ProductModel.php

SELECT *
FROM `produk`
ORDER BY `id_produk` DESC
---
    public function getDataProduct($id_product = false)
    {
        if ($id_product === false) {
            return $this->builder->orderBy('id_produk', 'DESC')->get()->getResultArray();