app/Models/UserModel.php

    public function getDataUsers($username = false)
    {
        if ($username === false) {
            return $this->builder->orderBy('id_pengguna', 'DESC')->get()->getResultArray();
        }
        return $this->builder->where('username', $username)->get()->getResultArray();
---
SELECT *
FROM `pengguna`
ORDER BY `id_pengguna` DESC
SELECT *
FROM `pengguna`
WHERE `username` = 'admin'

    public function getDataUsersById($id)
    {
        return $this->builder->where('id_pengguna', $id)->get()->getResultArray();
---
SELECT *
FROM `pengguna`
WHERE `id_pengguna` = '56'

    public function setStatusOnline($status, $id)
    {
        return $this->builder->set('online_status', $status)->where('id_pengguna', $id)->update();
---
UPDATE `pengguna` SET `online_status` = '0'
WHERE `id_pengguna` = '56'